tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "joshuaclayton/formulae"
tap "netlify/netlifyctl"
tap "olleolleolle/adr-tools"
cask "java"
# Automatic configure script builder
brew "autoconf"
# Shell extension to jump to frequently used directories
brew "autojump"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# GNU database manager
brew "gdbm"
# SSL/TLS cryptography library
brew "openssl"
brew asdf
# Library for command-line editing
brew "readline"
# Command-line interface for SQLite
brew "sqlite"
# General-purpose data compression with high compression ratio
brew "xz"
# Interpreted, interactive, object-oriented programming language
brew "python"
# Official Amazon AWS command-line interface
brew "awscli"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Collection of portable C++ source libraries
brew "boost"
# Utility that creates projects from templates
brew "cookiecutter"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Good-lookin' diffs with diff-highlight and more
brew "diff-so-fancy"
# Modern replacement for 'ls'
brew "exa"
# Simple, fast and user-friendly alternative to find
brew "fd"
# High quality MPEG Audio Layer III (MP3) encoder
brew "lame"
# H.264/AVC encoder
brew "x264"
# High-performance, high-quality MPEG-4 video library
brew "xvid"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Command-line fuzzy finder written in Go
brew "fzf"
# The GNU Compiler Collection
brew "gcc@4.9"
# GIF image/animation creator/editor
brew "gifsicle"
# Command-line utility for uploading Gists
brew "gist"
# Distributed revision control system
brew "git"
# Small git utilities
brew "git-extras"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# GNU version of the tar archiving utility
brew "gnu-tar"
# Open-source build automation tool based on the Groovy and Kotlin DSL
brew "gradle"
# GNU grep, egrep and fgrep
brew "grep"
# Improved top (interactive process viewer)
brew "htop"
# Display an interface's bandwidth usage
brew "iftop"
# Generic library support script
brew "libtool"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# File system benchmark tool
brew "iozone"
# Regular expressions library
brew "oniguruma"
# Lightweight and flexible command-line JSON processor
brew "jq"
# X.509 and CMS library
brew "libksba"
# YAML Parser
brew "libyaml"
# Mac App Store command-line interface
brew "mas"
# Java-based project management
brew "maven"
# Intercept, modify, replay, save HTTP/S traffic
brew "mitmproxy"
# Simple tool to make locally trusted development certificates
brew "mkcert"
# High-performance, schema-free, document-oriented database
brew "mongodb"
# NCurses Disk Usage
brew "ncdu"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Network grep
brew "ngrep"
# Port scanning utility for large networks
brew "nmap"
# Platform built on V8 to build network applications
brew "node"
# Manage multiple Node.js versions
brew "nvm"
# Manage compile and link flags for libraries
brew "pkg-config"
# Object-relational database system
brew "postgresql", restart_service: true
# Wrapper to colorize and simplify ping's output
brew "prettyping"
# Perl-powered file rename script with many helpful built-ins
brew "rename"
# Rootkit hunter
brew "rkhunter"
# Powerful, clean, object-oriented scripting language
brew "ruby", link: true
# Add a public key to a remote machine's authorized_keys file
brew "ssh-copy-id"
# TCP flow recorder
brew "tcpflow"
# Code-search similar to ack
brew "the_silver_searcher"
# Simplified and community-driven man pages
brew "tldr"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Vi 'workalike' with many additional features
brew "vim"
# Internet file retriever
brew "wget"
# Copy terminal output to clipboard
brew "yank"
# JavaScript package manager
brew "yarn"
# Download YouTube videos from the command-line
brew "youtube-dl"
# General-purpose lossless data-compression library
brew "zlib"
# The next-generation plugin manager for zsh
brew "zplug"
# UNIX shell (command interpreter)
brew "zsh"
# A command line tool to identify unused code.
brew "joshuaclayton/formulae/unused"
# CLI to interact with netlify.com
brew "netlify/netlifyctl/netlifyctl"
# A command-line tool for working with Architecture Decision Records (ADRs).
brew "olleolleolle/adr-tools/adr_tools"
cask "alfred"
cask "arq"
cask "charles"
cask "dash"
cask "firefox"
cask "google-chrome-canary"
cask "google-hangouts"
cask "hipchat"
cask "iina"
cask "insomnia"
cask "istat-menus"
cask "iterm2"
cask "kaleidoscope"
cask "kap"
cask "macvim"
cask "numi"
cask "odrive"
cask "onyx"
cask "opera"
cask "safari-technology-preview"
cask "sequel-pro"
cask "sketch"
cask "skitch"
cask "slack"
cask "spectacle"
cask "spotify"
cask "sublime-text"
cask "the-unarchiver"
cask "tower"
cask "tunnelblick"
cask "versions"
cask "visual-studio-code"
cask "vlc"
mas "Alternote", id: 974971992
mas "Bear", id: 1091189122
mas "DaisyDisk", id: 411643860
mas "Disk Diag", id: 672206759
mas "GarageBand", id: 682658836
mas "GIF Brewery 3", id: 1081413713
mas "Glyphs Mini", id: 469036911
mas "Keynote", id: 409183694
mas "Kindle", id: 405399194
mas "Monosnap", id: 540348655
mas "Navicat Essentials for PostgreSQL", id: 466725643
mas "Noizio", id: 928871589
mas "Numbers", id: 409203825
mas "OmniGraffle", id: 711830901
mas "Pages", id: 409201541
mas "Patterns", id: 429449079
mas "Sip", id: 507257563
mas "SnippetsLab", id: 1006087419
mas "Spark", id: 1176895641
mas "SubEthaEdit", id: 728530824
mas "Vicinity", id: 1143779658
mas "Wunderlist", id: 410628904
mas "xScope", id: 889428659
