tap "archivebox/archivebox"
tap "buo/cask-upgrade"
tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/services"
tap "olleolleolle/adr-tools"
# Core application library for C
brew "glib"
# Manage compile and link flags for libraries
brew "pkg-config"
brew "difftastic"
# General-purpose data compression with high compression ratio
brew "xz"
# Toolkit for image loading and pixel buffer manipulation
brew "gdk-pixbuf"
# OpenType text shaping engine
brew "harfbuzz"
# Framework for layout and rendering of i18n text
brew "pango"
# Library to render SVG files using Cairo
brew "librsvg"
# Color management engine supporting ICC profiles
brew "little-cms2"
# Image format providing lossless and lossy compression for web images
brew "webp"
# Automatic configure script builder
brew "autoconf"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Generic library support script
brew "libtool"
# YAML Parser
brew "libyaml"
# Extendable version manager with support for Ruby, Node.js, Erlang & more
brew "asdf"
# Official Amazon AWS command-line interface
brew "awscli"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Collection of portable C++ source libraries
brew "boost"
# Manage your dotfiles across multiple diverse machines, securely
brew "chezmoi"
# Enables you to reproduce the CircleCI environment locally
brew "circleci"
# Cross-platform make
brew "cmake"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Good-lookin' diffs with diff-highlight and more
brew "diff-so-fancy"
# Tool for exploring each layer in a docker image
brew "dive"
# Modern replacement for 'ls'
brew "exa"
# Perl lib for reading and writing EXIF metadata
brew "exiftool"
# CLI tool for quick access to files and directories
brew "fasd"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Library to load and enumerate PKCS#11 modules
brew "p11-kit"
# Validating, recursive, caching DNS resolver
brew "unbound"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# High quality MPEG Audio Layer III (MP3) encoder
brew "lame"
# Library for JPEG-2000 image manipulation
brew "openjpeg"
# Image processing and image analysis library
brew "leptonica"
# Subtitle renderer for the ASS/SSA subtitle format
brew "libass"
# H.264/AVC encoder
brew "x264"
# High-performance, high-quality MPEG-4 video library
brew "xvid"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Fast and simple Node.js version manager
brew "fnm"
# Monitor a directory for changes and run a shell command
brew "fswatch"
# Terminal JSON viewer
brew "fx"
# Command-line fuzzy finder written in Go
brew "fzf"
# Graphics library to dynamically manipulate images
brew "gd"
# GNU database manager
brew "gdbm"
# GitHub command-line tool
brew "gh"
# Interpreter for PostScript and PDF
brew "ghostscript"
# GIF image/animation creator/editor
brew "gifsicle"
# Command-line utility for uploading Gists
brew "gist"
# Distributed revision control system
brew "git"
# Small git utilities
brew "git-extras"
# Simple and efficient way to access statistics in git
brew "git-quick-stats"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# GNU version of the tar archiving utility
brew "gnu-tar"
# Toolkit for creating graphical user interfaces
brew "gtk+3"
# Gnumeric spreadsheet program
brew "goffice"
# GNOME Spreadsheet Application
brew "gnumeric"
# X.509 and CMS library
brew "libksba"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Generate introspection data for GObject libraries
brew "gobject-introspection"
# Image manipulation
brew "netpbm"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# GNU grep, egrep and fgrep
brew "grep"
# Open-source video transcoder available for Linux, Mac, and Windows
brew "handbrake"
# Improved top (interactive process viewer)
brew "htop"
# Display an interface's bandwidth usage
brew "iftop"
# ISO/IEC 23008-12:2017 HEIF file format decoder and encoder
brew "libheif"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# File system benchmark tool
brew "iozone"
# Access DVDs as block devices without the decryption
brew "libdvdcss"
# Mac App Store command-line interface
brew "mas"
# Simple tool to make locally trusted development certificates
brew "mkcert"
# NCurses Disk Usage
brew "ncdu"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Network grep
brew "ngrep"
# Port scanning utility for large networks
brew "nmap"
# Libraries for security-enabled client and server applications
brew "nss"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# Cross-platform application and UI framework
brew "qt"
# PDF converter to SVG
brew "pdf2svg"
# Draw UML diagrams
brew "plantuml"
# Wrapper to colorize and simplify ping's output
brew "prettyping"
# Interpreted, interactive, object-oriented programming language
brew "python@3.10"
# Visualize data generated by Cachegrind and Calltree
brew "qcachegrind"
# Perl-powered file rename script with many helpful built-ins
brew "rename"
# Polyglot runtime manager (asdf rust clone)
brew "rtx"
# Add a public key to a remote machine's authorized_keys file
brew "ssh-copy-id"
# TCP/IP packet demultiplexer
brew "tcpflow"
# Code-search similar to ack
brew "the_silver_searcher"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Vi 'workalike' with many additional features
brew "vim"
# Internet file retriever
brew "wget"
# Fast CSV toolkit written in Rust
brew "xsv"
# Copy terminal output to clipboard
brew "yank"
# Process YAML, JSON, XML, CSV and properties documents from the CLI
brew "yq"
# Fork of youtube-dl with additional features and fixes
brew "yt-dlp"
# General-purpose lossless data-compression library
brew "zlib"
# UNIX shell (command interpreter)
brew "zsh"
# Terraform
brew "hashicorp/tap/terraform"
# GraphQL client
cask "altair-graphql-client"
# Multi-cloud backup application
cask "arq"
# Prevents your sleeping computer from connecting to Bluetooth accessories
cask "bluesnooze"
# Opensource IDE for exploring and testing api's
cask "bruno"
# Screen capturing tool
cask "cleanshot"
# API documentation browser and code snippet manager
cask "dash"
# Voice and text chat software
cask "discord"
# Text editor
cask "emacs"
# Web browser
cask "firefox"
cask "font-inconsolata-g"
cask "font-input"
# Developer targeted fonts with a high number of glyphs
cask "font-meslo-lg-nerd-font"
cask "font-roboto-mono-for-powerline"
cask "font-source-code-pro"
# Web browser
cask "google-chrome"
# Free and open-source media player
cask "iina"
# System monitoring app
cask "istat-menus"
# Spot and merge differences in text and image files or folders
cask "kaleidoscope"
# Calculator and converter application
cask "numi"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Tool to make any cloud storage unified, synchronized, shareable, and encrypted
cask "odrive"
# HTTP debugging proxy
cask "proxyman"
# All-in-one bookmark manager
cask "raindropio"
# Control your tools with a few keystrokes
cask "raycast"
# Web browser
cask "safari-technology-preview"
# MySQL/MariaDB database management platform
cask "sequel-pro"
# Music streaming service
cask "spotify"
# Unpacks archive files
cask "the-unarchiver"
# Open-source code editor
cask "visual-studio-code"
# Multimedia player
cask "vlc"
# Native desktop client for WhatsApp
cask "whatsapp"
mas "1Password for Safari", id: 1569813296
mas "Bear", id: 1091189122
mas "Craft", id: 1487937127
mas "Drafts", id: 1435957248
mas "Kindle", id: 302584613
mas "Mela", id: 1568924476
mas "Microsoft Excel", id: 462058435
mas "Microsoft OneNote", id: 784801555
mas "Microsoft Word", id: 462054704
mas "MoneyMoney", id: 872698314
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Patterns", id: 429449079
mas "PDF Viewer", id: 1120099014
mas "PDFScanner", id: 410968114
mas "Raindrop.io for Safari", id: 957810159
mas "Save to Raindrop.io", id: 1549370672
