tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "buo/cask-upgrade"
tap "homebrew/core"
tap "homebrew/services"
tap "olleolleolle/adr-tools"

# GNU database manager
brew "gdbm"
# Library for command-line editing
brew "readline"
# General-purpose data compression with high compression ratio
brew "xz"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# Core application library for C
brew "glib"
# Manage compile and link flags for libraries
brew "pkg-config"
# Generate introspection data for GObject libraries
brew "gobject-introspection"
# OpenType text shaping engine
brew "harfbuzz"
# Framework for layout and rendering of i18n text
brew "pango"
# Automatic configure script builder
brew "autoconf"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Generic library support script
brew "libtool"
# YAML Parser
brew "libyaml"
# Extendable version manager with support for Ruby, Node.js, Erlang & more
brew "asdf"
# Interpreted, interactive, object-oriented programming language
brew "python@3.10"
# Official Amazon AWS command-line interface
brew "awscli"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Collection of portable C++ source libraries
brew "boost"
# Enables you to reproduce the CircleCI environment locally
brew "circleci"
# Cross-platform make
brew "cmake"
# Secure runtime for JavaScript and TypeScript
brew "deno"
# Good-lookin' diffs with diff-highlight and more
brew "diff-so-fancy"
# Tool for exploring each layer in a docker image
brew "dive"
# Modern replacement for 'ls'
brew "exa"
# CLI tool for quick access to files and directories
brew "fasd"
# Simple, fast and user-friendly alternative to find
brew "fd"
# High quality MPEG Audio Layer III (MP3) encoder
brew "lame"
# Subtitle renderer for the ASS/SSA subtitle format
brew "libass"
# H.264/AVC encoder
brew "x264"
# High-performance, high-quality MPEG-4 video library
brew "xvid"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Fast and simple Node.js version manager
brew "fnm"
# Monitor a directory for changes and run a shell command
brew "fswatch"
# Platform built on V8 to build network applications
brew "node"
# Command-line JSON processing tool
brew "fx"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# GIF image/animation creator/editor
brew "gifsicle"
# Command-line utility for uploading Gists
brew "gist"
# Distributed revision control system
brew "git"
# Small git utilities
brew "git-extras"
# Simple and efficient way to access statistics in git
brew "git-quick-stats"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# GNU version of the tar archiving utility
brew "gnu-tar"
# GNOME Spreadsheet Application
brew "gnumeric"
# X.509 and CMS library
brew "libksba"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# GNU grep, egrep and fgrep
brew "grep"
# Improved top (interactive process viewer)
brew "htop"
# Display an interface's bandwidth usage
brew "iftop"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# File system benchmark tool
brew "iozone"
# Mac App Store command-line interface
brew "mas"
# Simple tool to make locally trusted development certificates
brew "mkcert"
# NCurses Disk Usage
brew "ncdu"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Network grep
brew "ngrep"
# Port scanning utility for large networks
brew "nmap"
# Manage multiple Node.js versions
brew "nvm"
# Cross-platform application and UI framework
brew "qt"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# PDF converter to SVG
brew "pdf2svg"
# Draw UML diagrams
brew "plantuml"
# Wrapper to colorize and simplify ping's output
brew "prettyping"
# Perl-powered file rename script with many helpful built-ins
brew "rename"
# Add a public key to a remote machine's authorized_keys file
brew "ssh-copy-id"
# Version control system designed to be a better CVS
brew "subversion"
# TCP/IP packet demultiplexer
brew "tcpflow"
# Code-search similar to ack
brew "the_silver_searcher"
# Simplified and community-driven man pages
brew "tldr"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Command-line interface for Vercel
brew "vercel-cli"
# Vi 'workalike' with many additional features
brew "vim"
# Internet file retriever
brew "wget"
# Fast CSV toolkit written in Rust
brew "xsv"
# Copy terminal output to clipboard
brew "yank"
# JavaScript package manager
brew "yarn"
# Download YouTube videos from the command-line
brew "youtube-dl"
# Process YAML documents from the CLI
brew "yq"
# General-purpose lossless data-compression library
brew "zlib"
# UNIX shell (command interpreter)
brew "zsh"
# Manage your dotfiles across multiple diverse machines, securely
brew "chezmoi"

# A command-line tool for working with Architecture Decision Records (ADRs).
brew "olleolleolle/adr-tools/adr_tools"
# GraphQL client
cask "altair-graphql-client"
# Web debugging Proxy application
cask "charles"
# API documentation browser and code snippet manager
cask "dash"
# Text editor
cask "emacs"
# Web browser
cask "firefox"
cask "font-source-code-pro"
cask "font-inconsolata-g"
cask "font-input"
cask "font-roboto-mono-for-powerline"
cask "font-meslo-lg-nerd-font"
# Web browser
cask "google-chrome-canary"
# Set of tools to manage resources and applications hosted on Google Cloud
cask "google-cloud-sdk"
# Desktop automation application
cask "hammerspoon"
# Free and open-source media player
cask "iina"
# HTTP and GraphQL Client
cask "insomnia"
# Spot and merge differences in text and image files or folders
cask "kaleidoscope"
# Calculator and converter application
cask "numi"
# Tool to make any cloud storage unified, synchronized, shareable, and encrypted
cask "odrive"
# Modern and intuitive HTTP Debugging Proxy app
cask "proxyman"
# Collaboration platform for API development
cask "postman"
# Alfred replacement
cask "raycast"
# JavaScript playground that auto-evaluates as code is typed
cask "runjs"
# Web browser
cask "safari-technology-preview"
# MySQL/MariaDB database management platform
cask "sequel-pro"
# Music streaming service
cask "spotify"
# Unpacks archive files
cask "the-unarchiver"
# Free and open-source OpenVPN client
cask "tunnelblick"
# Open-source code editor
cask "visual-studio-code"
# Multimedia player
cask "vlc"
# Video communication and virtual meeting platform
cask "zoom"

mas "Bear", id: 1091189122
mas "Darkroom", id: 953286746
mas "Evernote Web Clipper", id: 1481669779
mas "Keynote", id: 409183694
mas "Kindle", id: 405399194
mas "LiquidText", id: 922765270
mas "MarginNote 3", id: 1423522373
mas "Microsoft Excel", id: 462058435
mas "Microsoft OneNote", id: 784801555
mas "MoneyMoney", id: 872698314
mas "mymind", id: 1532801185
mas "Notability", id: 360593530
mas "Noteshelf", id: 1488905707
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Patterns", id: 429449079
mas "PDFScanner", id: 410968114
mas "Raindrop.io for Safari", id: 957810159
mas "Save to Raindrop.io", id: 1549370672
mas "Spark", id: 1176895641
